In [1]:
pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\navid\anaconda3\lib\site-packages (2.9.3)
Note: you may need to restart the kernel to use updated packages.

In [2]:
# import all dependencies
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import psycopg2
import matplotlib.pyplot as plt
from passwords import password

In [3]:
from sqlalchemy import create_engine
engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/ERD')
connection = engine.connect()

In [4]:
 # Create Pandas DataFrames from each SQL table.

Departments_df = pd.read_sql("SELECT * FROM departments", connection)
Dept_Emp_df = pd.read_sql("SELECT * FROM dept_emp", connection)
Dept_Manager_df=pd.read_sql("SELECT * FROM dept_manager", connection)
Employees_df = pd.read_sql("SELECT * FROM employees", connection)
Salaries_df = pd.read_sql("SELECT * FROM salaries", connection)
Titles_df = pd.read_sql("SELECT * FROM titles", connection)

Employees_df.head()

   emp_no emp_title  birth_date  first_name  last_name sex   hire_date
0  473302     s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053     e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444     e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786     s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238     e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18